package ItHeiMa.reference;

public class ReferenceTest1 {
    public static void main(String[] args) {
        /*
        * 1.方法引用的概述
        *   作用：把已经有的方法拿过来用，当做函数式接口中抽象方法的方法体(进一步简化lambda表达式)
        *   要满足哪些要求才能用方法引用？
        *       (1)引用处必须要是函数式接口
        *       (2)被引用的方法必须已经存在
        *       (3)被引用方法的形参和返回值需要跟抽象方法保持一致
        *       (4)被引用方法的功能要满足当前需求
        *
        * 2.方法引用怎么引用？
        *   （1）引用静态方法
        *   （2）引用其他类的成员方法
        *   （3）引用本类或父类的成员方法
        *   （4）引用构造方法
        *   （5）类名引用成员方法
        *   （6）引用数组的构造方法
        * */
    }
}
